backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Conv3D
    config:
      activation: relu
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 1
      - 24
      - 24
      - 24
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.05
      kernel_regularizer:
        class_name: L1L2
        config:
          l1: 0.0010000000474974513
          l2: 0.0
      kernel_size: !!python/tuple
      - 2
      - 2
      - 2
      name: conv3d_1
      padding: same
      strides: &id002 !!python/tuple
      - 1
      - 1
      - 1
      trainable: true
      use_bias: true
  - class_name: Conv3D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 2
      - 2
      - 2
      name: conv3d_2
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: AveragePooling3D
    config:
      data_format: channels_first
      name: average_pooling3d_1
      padding: valid
      pool_size: &id003 !!python/tuple
      - 2
      - 2
      - 2
      strides: *id003
      trainable: true
  - class_name: Dropout
    config:
      name: dropout_1
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
  - class_name: Conv3D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 2
      - 2
      - 2
      name: conv3d_3
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Conv3D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 2
      - 2
      - 2
      name: conv3d_4
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: AveragePooling3D
    config:
      data_format: channels_first
      name: average_pooling3d_2
      padding: valid
      pool_size: &id004 !!python/tuple
      - 2
      - 2
      - 2
      strides: *id004
      trainable: true
  - class_name: Dropout
    config:
      name: dropout_2
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
  - class_name: Conv3D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 2
      - 2
      - 2
      name: conv3d_5
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Conv3D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 2
      - 2
      - 2
      name: conv3d_6
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Dropout
    config:
      name: dropout_3
      noise_shape: null
      rate: 0.3
      seed: null
      trainable: true
  - class_name: Flatten
    config:
      data_format: channels_first
      name: flatten_1
      trainable: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 512
      use_bias: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 16
      use_bias: true
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 2
      use_bias: true
  name: sequential_1
keras_version: 2.2.4
